simulations/theta-beta-m/highres_mach3/alpha-10/system/blockMeshDict

// User: bsp
// Mesh generated on 05/15/2022 03:53:58

// c = 3.0
// t = 0.3
// lf = -6
// lw = 6
// ht = 6
// hb = -6
// alpha = -10.0
// n_foil = 200
// n_north = 150
// n_east = 200
// n_south = 150
// n_west = 200
// e_foil = 10
// e_north = 20
// e_east = 50
// e_south = 20
// e_west = 50

FoamFile
{
 version 2.0;
 format  ascii;
 class   dictionary;
 object  blockMeshDict;
}

convertToMeters  1.0;

vertices
(
    ( 2.954423259036624 -0.520944533000791 -0.05) // 0
    ( 1.5032588561683515 -0.11275110354856432 -0.05) // 1
    ( 0.0520944533000791 0.2954423259036624 -0.05) // 2
    ( -1.4511644028682724 0.4081934294522267 -0.05) // 3
    ( -2.954423259036624 0.520944533000791 -0.05) // 4
    ( -1.5032588561683515 0.11275110354856432 -0.05) // 5
    ( -0.0520944533000791 -0.2954423259036624 -0.05) // 6
    ( 1.4511644028682724 -0.4081934294522267 -0.05) // 7
    ( 6 -0.520944533000791 -0.05) // 8
    ( 6 6 -0.05) // 9
    ( 2.954423259036624 6 -0.05) // 10
    ( 1.5032588561683515 6 -0.05) // 11
    ( 0.0520944533000791 6 -0.05) // 12
    ( -1.4511644028682724 6 -0.05) // 13
    ( -2.954423259036624 6 -0.05) // 14
    ( -6 6 -0.05) // 15
    ( -6 0.520944533000791 -0.05) // 16
    ( -6 -6 -0.05) // 17
    ( -2.954423259036624 -6 -0.05) // 18
    ( -1.5032588561683515 -6 -0.05) // 19
    ( -0.0520944533000791 -6 -0.05) // 20
    ( 1.4511644028682724 -6 -0.05) // 21
    ( 2.954423259036624 -6 -0.05) // 22
    ( 6 -6 -0.05) // 23
    ( 2.954423259036624 -0.520944533000791 0.05) // 24
    ( 1.5032588561683515 -0.11275110354856432 0.05) // 25
    ( 0.0520944533000791 0.2954423259036624 0.05) // 26
    ( -1.4511644028682724 0.4081934294522267 0.05) // 27
    ( -2.954423259036624 0.520944533000791 0.05) // 28
    ( -1.5032588561683515 0.11275110354856432 0.05) // 29
    ( -0.0520944533000791 -0.2954423259036624 0.05) // 30
    ( 1.4511644028682724 -0.4081934294522267 0.05) // 31
    ( 6 -0.520944533000791 0.05) // 32
    ( 6 6 0.05) // 33
    ( 2.954423259036624 6 0.05) // 34
    ( 1.5032588561683515 6 0.05) // 35
    ( 0.0520944533000791 6 0.05) // 36
    ( -1.4511644028682724 6 0.05) // 37
    ( -2.954423259036624 6 0.05) // 38
    ( -6 6 0.05) // 39
    ( -6 0.520944533000791 0.05) // 40
    ( -6 -6 0.05) // 41
    ( -2.954423259036624 -6 0.05) // 42
    ( -1.5032588561683515 -6 0.05) // 43
    ( -0.0520944533000791 -6 0.05) // 44
    ( 1.4511644028682724 -6 0.05) // 45
    ( 2.954423259036624 -6 0.05) // 46
    ( 6 -6 0.05) // 47
);

blocks
(
    // block 0
   hex (0 8 9 10 24 32 33 34) (200 150 1) simpleGrading ( 50 20 1)
    // block 1
   hex (0 10 11 1 24 34 35 25) (150 200 1) simpleGrading ( 20 10 1)
    // block 2
   hex (12 2 1 11 36 26 25 35) (150 200 1) simpleGrading ( 0.05 10 1)
    // block 3
   hex (2 12 13 3 26 36 37 27) (150 200 1) simpleGrading ( 20 10 1)
    // block 4
   hex (14 4 3 13 38 28 27 37) (150 200 1) simpleGrading ( 0.05 10 1)
    // block 5
   hex (14 15 16 4 38 39 40 28) (200 150 1) simpleGrading ( 50 0.05 1)
    // block 6
   hex (4 16 17 18 28 40 41 42) (200 150 1) simpleGrading ( 50 20 1)
    // block 7
   hex (4 18 19 5 28 42 43 29) (150 200 1) simpleGrading ( 20 10 1)
    // block 8
   hex (20 6 5 19 44 30 29 43) (150 200 1) simpleGrading ( 0.05 10 1)
    // block 9
   hex (6 20 21 7 30 44 45 31) (150 200 1) simpleGrading ( 20 10 1)
    // block 10
   hex (22 0 7 21 46 24 31 45) (150 200 1) simpleGrading ( 0.05 10 1)
    // block 11
   hex (22 23 8 0 46 47 32 24) (200 150 1) simpleGrading ( 50 0.05 1)
);



boundary
(
 inlet
 {
     type patch;
     faces
     (
         (15 39 40 16)
         (16 40 41 17)
     );
 }
 outlet
 {
     type patch;
     faces
     (
         (23 47 32 8)
         (8 32 33 9)
     );
 }
 airfoil
 {
     type wall;
     faces
     (
         (0 24 25 1)
         (1 25 26 2)
         (2 26 27 3)
         (3 27 28 4)
         (4 28 29 5)
         (5 29 30 6)
         (6 30 31 7)
         (7 31 24 0)
     );
 }
 top_fore
 {
     type wall;
     faces
     (
         (10 35 34 11)
         (11 36 35 12)
         (12 37 36 13)
         (13 38 37 14)
         (14 39 38 15)
     );
 }
 top_wake
 {
     type wall;
     faces
     (
         (9 34 33 10)
     );
 }
 bottom_fore
 {
     type wall;
     faces
     (
         (17 41 42 18)
         (18 42 43 19)
         (19 43 44 20)
         (20 44 45 21)
         (21 45 46 22)
     );
 }
 bottom_wake
 {
     type wall;
     faces
     (
         (22 46 47 23)
     );
 }

);
